---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.CanTotal
source: html/88ffc634-bae0-0ef7-b232-81cd80a391fe.htm
---
# Autodesk.Revit.DB.ScheduleField.CanTotal Method

Indicates if totals can be enabled for this field.

## Syntax (C#)
```csharp
public bool CanTotal()
```

## Returns
True if this field can be totaled, false otherwise.